

Git 使用文档
===============     

Git是一个分布式的版本控制系统，使用git软件，首先要下载安装，官网下载地址 `a link`_.

.. _a link: http://git-scm.com/

 
Github是开源的源代码管理网站，属于国外的代码托管库，要使用它，得要先注册一个用户名创建一个库。具体使用参照GitHub的网站  `b link`_.

.. _b link: https://github.com  


Git在我们日常工作中的代码提交中会使用到，我们所做的项目不可能是由一个人来完成，而是要一个团队。就会出现多人同时开发代码。这时就要使用到git来创建分支、管理分支、合并分支，非常的方便。详细的分支管理及其命名的使用可以在网上找到详细的介绍。
创建一个git版本库，通过$git clone［就是clone github上的项目］ 命令将版本库下载到本地，进行修改，修改完成后提交git push 可以更新到最新的版本库中。

除了GIT能够体现我们的工作以外，还有另一个就是QA（昂信嵌入式项目管理系统） IP地址是https://qa.emsym.com/redmine/my/page     [这里的使用必须得要有用户名与密码]  在这边我们可以将自己所加入的项目一一罗列在此，遇到的工作难题可以在这个系统下提交出来，可以帮你解决问题的技术人员会帮助你！



 




