

QA 使用文档
=======================================

QA，对项目进行管理的系统，很好的控制项目计划、项目进度                   
  * 项目组要将任务落实下来，并制定项目计划、项目进度。        
  * 每位研发人员要实时的将研发工作过程中的问题及解决方案提交到QA。    
  * 使用QA的研发人员建议看一下“smart”原则。  
  * SMART原则 
      * S=Specific 明确性
      * M=Measurable 可衡量性
      * A=Attainable 可达成性
      * R=Relevant 相关性
      * T=Time-bound 时限性
做好的项目，请测试人员测试。测试方法与测试报告请提交到QA。    

为了便于跟踪项目，还提供昂信嵌入式的QA系统接入，您可以通过电子邮件提出系统当中的bug、需要开发的新功能，也能够及时收到项目进展。
    
目前为您创建的用户有： 
           
zhuxiaohong@ringway.cn    
       
shengpengyun@ringway.cn     

必须使用以上发件人、发送邮件才被认为有效。        

收件人为 projects@emsym.org    
   
主题与内容根据需要填写，可以在附件中包含截图、文档等文件。      
 
当您发现一个新的bug、或者提出新的需求时，注意必须在邮件正文当中（通常是第一行或最后一行）写上：   
   
Project: emd1207        

与您相关的问题，有任何更新都会发送给您提醒邮件。您可以直接回复，但是不要修改邮件的默认主题。    


建议
请登录到QA系统查看工作报告     

 * 1 关注自己的工作进程。  
 * 2 关注本团队的工作状况。在这里我们的项目负责人应当实时了解项目的进度，以及遇到的问题，及时解决。
